app/controllers/books_controller.rb

  def show
    @book_new = Book.new
    @book = Book.find(params[:id])
---
SELECT  "books".* FROM "books" WHERE "books"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]

  def create
    @book = Book.new(book_params)
    @book.user_id = current_user.id
    if @book.save
      redirect_to book_path(@book), notice: "You have created book successfully."
    else
      @books = Book.all
---
INSERT INTO "books" ("title", "body", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["title", "6/6"], ["body", "もうすぐ母の誕生日だな"], ["user_id", 1], ["created_at", "2021-06-05 23:39:25.362578"], ["updated_at", "2021-06-05 23:39:25.362578"]]
SELECT "books".* FROM "books"